tap "epk/epk" # for 'font-sf-mono-nerd-font'
tap "homebrew/bundle"
tap "koekeishiya/formulae" # for 'yabai' and 'skhd'
tap "supabase/tap"
tap "buo/cask-upgrade" # to upgrade brew and mas apps

brew "fd"
brew "fzf"
brew "gh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lazygit"
brew "llvm"
brew "mas" # mac app store
brew "neovim"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "stow"
brew "supabase/tap/supabase"
brew "tmux"
brew "zoxide"
brew "zsh-syntax-highlighting"

cask "1password"
cask "alacritty"
cask "arc"
cask "blender"
cask "docker"
cask "font-sf-mono-nerd-font"
cask "iina"
cask "karabiner-elements"
cask "logi-options-plus"
cask "obsidian"
cask "onyx"
cask "postman"
cask "raycast"
cask "the-unarchiver"
cask "zed"

mas "Things 3", id: 904280696
mas "Notability: Notizen, PDF", id: 360593530
